<?php
//array(4) {
//  [33]=>
//  array(5) {
//    ["id"]=>
//    int(214)
//    ["title"]=>
//    string(45) "广东省激光产业技术创新联盟简介"
//    ["description"]=>
//    string(761) "广东省激光产业技术创联盟是由从事激光成套装备及加工技术的企业、高等院校、科研机构、行业协会等自愿组成的一个集专业性、学术性和联合性于一体的非盈利性服务型社会团体。
//联盟本着高校与企业“优势互补、产学研结合、互惠互利、共同发展”的原则，整合激光产业技术资源，充分发挥高校、科研院所和生产企业在科技研发和原始创新上的技术优势以及广东激光加工装备企业在把握市场需求、开发新产品、实现科技成果转化上的强大动力，实现优势互补，信息共享，联合开展技术研究和开发，组织共性关键技术攻关，努力突破技术难题，为广东激光成套装备"
//    ["cate_id"]=>
//    int(33)
//    ["writer"]=>
//    string(0) ""
//  }
//  [34]=>
//  array(5) {
//    ["id"]=>
//    int(523)
//    ["title"]=>
//    string(36) "激光产业技术创新联盟章程"
//    ["description"]=>
//    string(0) ""
//    ["cate_id"]=>
//    int(34)
//    ["writer"]=>
//    string(0) ""
//  }
//  [35]=>
//  array(5) {
//    ["id"]=>
//    int(216)
//    ["title"]=>
//    string(52) "广东省激光产业技术创新联盟-组织架构"
//    ["description"]=>
//    string(0) ""
//    ["cate_id"]=>
//    int(35)
//    ["writer"]=>
//    string(0) ""
//  }
//  [36]=>
//  array(5) {
//    ["id"]=>
//    int(217)
//    ["title"]=>
//    string(51) "广东省激光产业技术创新联盟入会须知"
//    ["description"]=>
//    string(0) ""
//    ["cate_id"]=>
//    int(36)
//    ["writer"]=>
//    string(0) ""
//  }
//}


//数组去重 column为 null 则输出全部的字段，如果写了cate_id ,那就只输出 cate_id那一列
//index_key 去掉跟cate_id重复的数组
array_column($cat_id_news,null,'cate_id');